SFNFIH/szpi_esp32c3/sdkconfig.defaults
# LCKFB SZPI ESP32-C3 (立创·实战派 ESP32-C3) defaults
CONFIG_IDF_TARGET="esp32c3"

# 8MB external flash on this board
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Console on UART0 (CH343P USB-to-serial)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# CST816S: skip ID read on boards where it fails before first touch
CONFIG_ESP_LCD_TOUCH_CST816S_DISABLE_READ_ID=y

# Use GPIO11 as I2S DOUT (requires VDD SPI pin as GPIO)
CONFIG_ESP32C3_VDDSPI_AS_GPIO=y

# LVGL defaults for sensor dashboard UI
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_USE_LABEL=y
